app/views/favorites/_favorite-btn.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
<% if book.favorited_by?(current_user) %>
  <%= link_to book.favorites.count, book_favorite_path(book, user), method: :delete, class: "fas fa-heart heart_red", remote:true %>
<% else %>
  <%= link_to book.favorites.count, book_favorites_path(book), method: :post, class: "fas fa-heart heart_blue", remote:true %>