app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
              </td>
              <td>コメント数: <%= book.book_comments.count %></td>