app/views/books/show.html.erb

                  <%= link_to book_favorite_path(@book), method: :delete do %>
                    ♥<%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

              <% end %>
              <td>コメント数: <%= @book.book_comments.count %></td>
---
SELECT "books".* FROM "books"
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]