app/controllers/books_controller.rb

  def index
    @book = Book.new
    @books = Book.includes(:favorited_users).sort {|a,b| b.favorited_users.size <=> a.favorited_users.size}
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
SELECT "books".* FROM "books"
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?, ?)  [["book_id", 1], ["book_id", 2], ["book_id", 3]]

  def show
    @new_book = Book.new
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] = "You have created book successfully."
      redirect_to book_path(@book)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aa"], ["body", "aaa"], ["user_id", 1], ["created_at", "2021-08-25 09:30:32.933486"], ["updated_at", "2021-08-25 09:30:32.933486"]]
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
    @user = current_user
    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu"], ["updated_at", "2021-08-25 08:10:39.830842"], ["id", 2]]

  def destroy
    @book = Book.find(params[:id])
    @user = current_user
    @book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]