app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def show
    @books = Book.all

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
    @book = Book.find(params[:id])
    @user = current_user
    @book.destroy